20240612T011737--kdoc-189-goでスライスのメモリの開始ポインタを調べる__draft_code.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-06-13 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>KDOC 189: Goでスライスのメモリの開始ポインタを調べる</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">KDOC 189: Goでスライスのメモリの開始ポインタを調べる</h1>

<div id="outline-container-org506be79" class="outline-2">
<h2 id="org506be79"><a href="#org506be79">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org506be79">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org307971a" class="outline-2">
<h2 id="org307971a"><a href="#org307971a">概要</a></h2>
<div class="outline-text-2" id="text-org307971a">
<div class="org-src-container">
<pre class="src src-go">func main(){
        s1 := []byte{1, 2, 3}
        s2 := s1[1:]
        s3 := s1[2:]
        s4 := s1
        s4 = append(s4, 4)
        fmt.Printf("s1: %v, addr: %p, len: %d, cap: %d\n", s1, s1, len(s1), cap(s1))
        fmt.Printf("s2: %v, addr: %p, len: %d, cap: %d\n", s2, s2, len(s2), cap(s2))
        fmt.Printf("s3: %v, addr: %p, len: %d, cap: %d\n", s3, s3, len(s3), cap(s3))
        fmt.Printf("s4: %v, addr: %p, len: %d, cap: %d\n", s4, s4, len(s4), cap(s4))
}
</pre>
</div>

<pre class="example">
s1: [1 2 3], addr: 0xc0000120e0, len: 3, cap: 3
s2: [2 3], addr: 0xc0000120e1, len: 2, cap: 2
s3: [3], addr: 0xc0000120e2, len: 1, cap: 1
s4: [1 2 3 4], addr: 0xc0000120e8, len: 4, cap: 8
</pre>
</div>
</div>

<div id="outline-container-orgb01c291" class="outline-2">
<h2 id="orgb01c291"><a href="#orgb01c291">関連</a></h2>
<div class="outline-text-2" id="text-orgb01c291">
<ul class="org-ul">
<li><a href="20240608T113006--kdoc-188-『visual-guide-to-slices-in-go』__book.html#ID-20240608T113006">KDOC 188: 『Visual Guide to Slices in Go』</a>を深堀りする</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
